app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "geaaeg"], ["password", "[FILTERED]"], ["admin", 0], ["created_at", "2023-05-19 14:21:56.146418"], ["updated_at", "2023-05-19 14:21:56.146418"]]